numbers = [num for num in range(1, 8)]  # [1, 2, 3, 4, 5, 6, 7]

a = numbers[:]           # полная копия
b = numbers[::-1]        # в обратном порядке
c = numbers[::2]         # каждый второй, начиная с 0: [1, 3, 5, 7]
d = numbers[1::2]        # каждый второй, начиная с 1: [2, 4, 6]
e = numbers[0:1]         # первый элемент как список: [1]
f = numbers[-1]          # последний элемент: 7
g = numbers[3:4]         # элемент с индексом 3 как список: [4]
h = numbers[4:]          # от 4-го до конца: [5, 6, 7]
i = numbers[4:1:-1]      # от 4 до 1 в обратном порядке: [5, 4, 3]
j = numbers[2:5]         # от индекса 2 до 4: [3, 4, 5]

print("j =", j)  # вывод: [3, 4, 5]